{"id":"74675dbd-10f8-465a-9ade-4db33fe04af6","type":"tag","namespaces":["default"],"attributes":{"name":"cloudloadgen","description":"Installed by Cloud to Elastic Load Generator — filter this tag in Kibana to find or remove these assets."},"references":[],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"8.0.0"}
{"id":"3fbbc299-325c-49de-9a75-5d2bba416667","type":"dashboard","namespaces":["default"],"attributes":{"title":"AWS Artifact — Compliance Report Access","description":"","panelsJSON":"[{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":0,\"w\":12,\"h\":5,\"i\":\"bdb3be0c-98eb-4624-9083-aad9ffe4871b\"},\"panelIndex\":\"bdb3be0c-98eb-4624-9083-aad9ffe4871b\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"1593d511-6837-4446-99fe-091a5bc4101a\":{\"index\":\"1593d511-6837-4446-99fe-091a5bc4101a\",\"query\":{\"esql\":\"FROM logs-aws.artifact* | STATS `Total Report Accesses` = COUNT()\"},\"columns\":[{\"columnId\":\"Total Report Accesses\",\"fieldName\":\"Total Report Accesses\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"1593d511-6837-4446-99fe-091a5bc4101a\",\"layerType\":\"data\",\"metricAccessor\":\"Total Report Accesses\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":12,\"y\":0,\"w\":12,\"h\":5,\"i\":\"ccfdcf4c-b675-4667-8e1e-93df4d042577\"},\"panelIndex\":\"ccfdcf4c-b675-4667-8e1e-93df4d042577\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"28e8314d-8953-4434-a039-51daa18ec99b\":{\"index\":\"28e8314d-8953-4434-a039-51daa18ec99b\",\"query\":{\"esql\":\"FROM logs-aws.artifact* | STATS `Unique Reports` = COUNT_DISTINCT(`aws.artifact.report_name`)\"},\"columns\":[{\"columnId\":\"Unique Reports\",\"fieldName\":\"Unique Reports\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"28e8314d-8953-4434-a039-51daa18ec99b\",\"layerType\":\"data\",\"metricAccessor\":\"Unique Reports\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":0,\"w\":12,\"h\":5,\"i\":\"6d10e9f7-700d-4fe0-ac86-dd836a2eb006\"},\"panelIndex\":\"6d10e9f7-700d-4fe0-ac86-dd836a2eb006\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"71277c0f-6c72-4025-a0b5-3ca29807e9cf\":{\"index\":\"71277c0f-6c72-4025-a0b5-3ca29807e9cf\",\"query\":{\"esql\":\"FROM logs-aws.artifact* | WHERE `event.action` LIKE \\\"*agreement*\\\" | STATS `Agreement Actions` = COUNT()\"},\"columns\":[{\"columnId\":\"Agreement Actions\",\"fieldName\":\"Agreement Actions\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"71277c0f-6c72-4025-a0b5-3ca29807e9cf\",\"layerType\":\"data\",\"metricAccessor\":\"Agreement Actions\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":36,\"y\":0,\"w\":12,\"h\":5,\"i\":\"c1066d41-5be5-4306-83e1-7e22f4da6839\"},\"panelIndex\":\"c1066d41-5be5-4306-83e1-7e22f4da6839\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"b229d0f5-8699-4c24-88fc-7db723874457\":{\"index\":\"b229d0f5-8699-4c24-88fc-7db723874457\",\"query\":{\"esql\":\"FROM logs-aws.artifact* | STATS `Unique Users` = COUNT_DISTINCT(`user.name`)\"},\"columns\":[{\"columnId\":\"Unique Users\",\"fieldName\":\"Unique Users\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"b229d0f5-8699-4c24-88fc-7db723874457\",\"layerType\":\"data\",\"metricAccessor\":\"Unique Users\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":5,\"w\":24,\"h\":10,\"i\":\"3e0ad195-7545-4290-b247-3706015e5da3\"},\"panelIndex\":\"3e0ad195-7545-4290-b247-3706015e5da3\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Report Category\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"7522cb6a-e046-45a1-81e3-5a3e829c17eb\":{\"index\":\"7631999fea322229aedc6bbb084f1c6b1abc852017d9e296f1c36e6b367109b4\",\"query\":{\"esql\":\"FROM logs-aws.artifact* | STATS count = COUNT() BY category = `aws.artifact.report_category` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.artifact*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"category\",\"fieldName\":\"category\",\"label\":\"category\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.artifact*\",\"sourceField\":\"category\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"7631999fea322229aedc6bbb084f1c6b1abc852017d9e296f1c36e6b367109b4\",\"title\":\"logs-aws.artifact*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"7522cb6a-e046-45a1-81e3-5a3e829c17eb\",\"primaryGroups\":[\"category\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.artifact* | STATS count = COUNT() BY category = `aws.artifact.report_category` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"7631999fea322229aedc6bbb084f1c6b1abc852017d9e296f1c36e6b367109b4\":{\"id\":\"7631999fea322229aedc6bbb084f1c6b1abc852017d9e296f1c36e6b367109b4\",\"title\":\"logs-aws.artifact*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.artifact*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Report Category\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":5,\"w\":24,\"h\":10,\"i\":\"bbc0448c-fceb-48e2-b2cf-61ffb65a2563\"},\"panelIndex\":\"bbc0448c-fceb-48e2-b2cf-61ffb65a2563\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Action Type\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"44599217-9fa1-4d23-bfd9-f6c698cfbe39\":{\"index\":\"7631999fea322229aedc6bbb084f1c6b1abc852017d9e296f1c36e6b367109b4\",\"query\":{\"esql\":\"FROM logs-aws.artifact* | STATS count = COUNT() BY action = `event.action` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.artifact*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"action\",\"fieldName\":\"action\",\"label\":\"action\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.artifact*\",\"sourceField\":\"action\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"7631999fea322229aedc6bbb084f1c6b1abc852017d9e296f1c36e6b367109b4\",\"title\":\"logs-aws.artifact*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"44599217-9fa1-4d23-bfd9-f6c698cfbe39\",\"primaryGroups\":[\"action\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.artifact* | STATS count = COUNT() BY action = `event.action` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"7631999fea322229aedc6bbb084f1c6b1abc852017d9e296f1c36e6b367109b4\":{\"id\":\"7631999fea322229aedc6bbb084f1c6b1abc852017d9e296f1c36e6b367109b4\",\"title\":\"logs-aws.artifact*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.artifact*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Action Type\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":15,\"w\":48,\"h\":10,\"i\":\"cad75327-c0f5-42cb-a915-f7ca64cd9721\"},\"panelIndex\":\"cad75327-c0f5-42cb-a915-f7ca64cd9721\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Report Access Over Time\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"a867e21a-083d-4ad2-a944-62c64a8bb99b\":{\"index\":\"a867e21a-083d-4ad2-a944-62c64a8bb99b\",\"query\":{\"esql\":\"FROM logs-aws.artifact* | STATS count = COUNT() BY bucket = BUCKET(`@timestamp`, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"count\",\"fieldName\":\"count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"a867e21a-083d-4ad2-a944-62c64a8bb99b\",\"accessors\":[\"count\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"count\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Report Access Over Time\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":25,\"w\":48,\"h\":10,\"i\":\"233531af-161c-4ee1-ba8f-9eb87cff2667\"},\"panelIndex\":\"233531af-161c-4ee1-ba8f-9eb87cff2667\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Recent Report Accesses\",\"description\":\"\",\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"44258e26-5ca1-4a21-94fc-9cb2fee93440\":{\"index\":\"44258e26-5ca1-4a21-94fc-9cb2fee93440\",\"query\":{\"esql\":\"FROM logs-aws.artifact* | KEEP `@timestamp`, `aws.artifact.report_name`, `aws.artifact.report_category`, `user.name`, `event.action` | SORT `@timestamp` DESC | LIMIT 100\"},\"columns\":[{\"columnId\":\"`@timestamp`\",\"fieldName\":\"`@timestamp`\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.artifact.report_name\",\"fieldName\":\"aws.artifact.report_name\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.artifact.report_category\",\"fieldName\":\"aws.artifact.report_category\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"user.name\",\"fieldName\":\"user.name\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"event.action\",\"fieldName\":\"event.action\",\"meta\":{\"type\":\"string\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"44258e26-5ca1-4a21-94fc-9cb2fee93440\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"`@timestamp`\",\"isTransposable\":false},{\"columnId\":\"aws.artifact.report_name\",\"isTransposable\":false},{\"columnId\":\"aws.artifact.report_category\",\"isTransposable\":false},{\"columnId\":\"user.name\",\"isTransposable\":false},{\"columnId\":\"event.action\",\"isTransposable\":false}],\"rowHeight\":\"auto\",\"rowHeightLines\":1},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Recent Report Accesses\"}]","optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","timeRestore":true,"timeFrom":"now-24h","timeTo":"now","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"}},"references":[{"type":"tag","id":"74675dbd-10f8-465a-9ade-4db33fe04af6","name":"tag-ref-cloudloadgen"}],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.3.0"}
