{"id":"74675dbd-10f8-465a-9ade-4db33fe04af6","type":"tag","namespaces":["default"],"attributes":{"name":"cloudloadgen","description":"Installed by Cloud to Elastic Load Generator — filter this tag in Kibana to find or remove these assets."},"references":[],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"8.0.0"}
{"id":"22d5e5d8-62e8-4b5b-b9ec-f6bbe52e648b","type":"dashboard","namespaces":["default"],"attributes":{"title":"AWS Client VPN — Connection Monitoring","description":"","panelsJSON":"[{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":0,\"w\":12,\"h\":5,\"i\":\"10bb8c21-fa54-459e-8296-ee2f3312830f\"},\"panelIndex\":\"10bb8c21-fa54-459e-8296-ee2f3312830f\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"f1e1aac3-9d3e-4cca-81ab-0c4896006f8c\":{\"index\":\"f1e1aac3-9d3e-4cca-81ab-0c4896006f8c\",\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | STATS `Total Connections` = COUNT()\"},\"columns\":[{\"columnId\":\"Total Connections\",\"fieldName\":\"Total Connections\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"f1e1aac3-9d3e-4cca-81ab-0c4896006f8c\",\"layerType\":\"data\",\"metricAccessor\":\"Total Connections\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":12,\"y\":0,\"w\":12,\"h\":5,\"i\":\"4abfd148-5da4-4746-b9ea-14b293c667e9\"},\"panelIndex\":\"4abfd148-5da4-4746-b9ea-14b293c667e9\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"c3f6f41f-ea04-4d53-98c0-2e5ce5c9c5e9\":{\"index\":\"c3f6f41f-ea04-4d53-98c0-2e5ce5c9c5e9\",\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | WHERE `log.level` == \\\"failure\\\" | STATS `Failed Auth Count` = COUNT()\"},\"columns\":[{\"columnId\":\"Failed Auth Count\",\"fieldName\":\"Failed Auth Count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"c3f6f41f-ea04-4d53-98c0-2e5ce5c9c5e9\",\"layerType\":\"data\",\"metricAccessor\":\"Failed Auth Count\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":0,\"w\":12,\"h\":5,\"i\":\"cd088f1c-13a0-4904-a895-27877e83a6af\"},\"panelIndex\":\"cd088f1c-13a0-4904-a895-27877e83a6af\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"47bb19c8-ebbb-4800-b864-0c6100defb9f\":{\"index\":\"47bb19c8-ebbb-4800-b864-0c6100defb9f\",\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | STATS `Total Egress Bytes` = SUM(`aws.clientvpn.egress_bytes`)\"},\"columns\":[{\"columnId\":\"Total Egress Bytes\",\"fieldName\":\"Total Egress Bytes\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"47bb19c8-ebbb-4800-b864-0c6100defb9f\",\"layerType\":\"data\",\"metricAccessor\":\"Total Egress Bytes\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":36,\"y\":0,\"w\":12,\"h\":5,\"i\":\"f8b6cf1a-4b05-4331-be3e-5e7ca3857525\"},\"panelIndex\":\"f8b6cf1a-4b05-4331-be3e-5e7ca3857525\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"5a0926a2-cd90-49d3-ac3c-4afad7cdb04e\":{\"index\":\"5a0926a2-cd90-49d3-ac3c-4afad7cdb04e\",\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | STATS `Unique Users` = COUNT_DISTINCT(`aws.clientvpn.username`)\"},\"columns\":[{\"columnId\":\"Unique Users\",\"fieldName\":\"Unique Users\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"5a0926a2-cd90-49d3-ac3c-4afad7cdb04e\",\"layerType\":\"data\",\"metricAccessor\":\"Unique Users\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":5,\"w\":24,\"h\":10,\"i\":\"e9fb3f75-8d05-461d-a7b0-0095188b3429\"},\"panelIndex\":\"e9fb3f75-8d05-461d-a7b0-0095188b3429\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Connection Status\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"3d5889ad-022a-460d-ae92-62c1cdb51c3c\":{\"index\":\"bd63e3d3a24b2fd0e4c7ce0019c8d44cee11926de28af5a2ceb0f0b78bf7ef31\",\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | STATS count = COUNT() BY status = `log.level` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.clientvpn*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"status\",\"fieldName\":\"status\",\"label\":\"status\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.clientvpn*\",\"sourceField\":\"status\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"bd63e3d3a24b2fd0e4c7ce0019c8d44cee11926de28af5a2ceb0f0b78bf7ef31\",\"title\":\"logs-aws.clientvpn*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"3d5889ad-022a-460d-ae92-62c1cdb51c3c\",\"primaryGroups\":[\"status\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | STATS count = COUNT() BY status = `log.level` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"bd63e3d3a24b2fd0e4c7ce0019c8d44cee11926de28af5a2ceb0f0b78bf7ef31\":{\"id\":\"bd63e3d3a24b2fd0e4c7ce0019c8d44cee11926de28af5a2ceb0f0b78bf7ef31\",\"title\":\"logs-aws.clientvpn*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.clientvpn*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Connection Status\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":5,\"w\":24,\"h\":10,\"i\":\"91c9fc04-3c66-4100-9cc5-b298917af2c7\"},\"panelIndex\":\"91c9fc04-3c66-4100-9cc5-b298917af2c7\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Termination Reason\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"6b289545-f376-4fa5-9705-5d94521b70c7\":{\"index\":\"bd63e3d3a24b2fd0e4c7ce0019c8d44cee11926de28af5a2ceb0f0b78bf7ef31\",\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | STATS count = COUNT() BY reason = `aws.clientvpn.termination_reason` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.clientvpn*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"reason\",\"fieldName\":\"reason\",\"label\":\"reason\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.clientvpn*\",\"sourceField\":\"reason\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"bd63e3d3a24b2fd0e4c7ce0019c8d44cee11926de28af5a2ceb0f0b78bf7ef31\",\"title\":\"logs-aws.clientvpn*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"6b289545-f376-4fa5-9705-5d94521b70c7\",\"primaryGroups\":[\"reason\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | STATS count = COUNT() BY reason = `aws.clientvpn.termination_reason` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"bd63e3d3a24b2fd0e4c7ce0019c8d44cee11926de28af5a2ceb0f0b78bf7ef31\":{\"id\":\"bd63e3d3a24b2fd0e4c7ce0019c8d44cee11926de28af5a2ceb0f0b78bf7ef31\",\"title\":\"logs-aws.clientvpn*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.clientvpn*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Termination Reason\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":15,\"w\":48,\"h\":10,\"i\":\"d0875b23-8936-4ca7-89f0-0be5d992feb0\"},\"panelIndex\":\"d0875b23-8936-4ca7-89f0-0be5d992feb0\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Connection Events Over Time\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"dc6da6e8-bb22-4426-b7f0-6ba266a4821f\":{\"index\":\"dc6da6e8-bb22-4426-b7f0-6ba266a4821f\",\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | STATS count = COUNT() BY bucket = BUCKET(`@timestamp`, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"count\",\"fieldName\":\"count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"dc6da6e8-bb22-4426-b7f0-6ba266a4821f\",\"accessors\":[\"count\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"count\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Connection Events Over Time\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":25,\"w\":48,\"h\":10,\"i\":\"913ee978-0253-415c-bb70-c5545b6a44cd\"},\"panelIndex\":\"913ee978-0253-415c-bb70-c5545b6a44cd\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Recent Connections\",\"description\":\"\",\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"7001d55a-419e-49e1-aab4-2b93a80f9891\":{\"index\":\"7001d55a-419e-49e1-aab4-2b93a80f9891\",\"query\":{\"esql\":\"FROM logs-aws.clientvpn* | KEEP `@timestamp`, `aws.clientvpn.username`, `aws.clientvpn.source_ip`, `aws.clientvpn.egress_bytes`, `event.action` | SORT `@timestamp` DESC | LIMIT 100\"},\"columns\":[{\"columnId\":\"`@timestamp`\",\"fieldName\":\"`@timestamp`\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.clientvpn.username\",\"fieldName\":\"aws.clientvpn.username\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.clientvpn.source_ip\",\"fieldName\":\"aws.clientvpn.source_ip\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.clientvpn.egress_bytes\",\"fieldName\":\"aws.clientvpn.egress_bytes\",\"meta\":{\"type\":\"number\"}},{\"columnId\":\"event.action\",\"fieldName\":\"event.action\",\"meta\":{\"type\":\"string\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"7001d55a-419e-49e1-aab4-2b93a80f9891\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"`@timestamp`\",\"isTransposable\":false},{\"columnId\":\"aws.clientvpn.username\",\"isTransposable\":false},{\"columnId\":\"aws.clientvpn.source_ip\",\"isTransposable\":false},{\"columnId\":\"aws.clientvpn.egress_bytes\",\"isTransposable\":false},{\"columnId\":\"event.action\",\"isTransposable\":false}],\"rowHeight\":\"auto\",\"rowHeightLines\":1},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Recent Connections\"}]","optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","timeRestore":true,"timeFrom":"now-24h","timeTo":"now","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"}},"references":[{"type":"tag","id":"74675dbd-10f8-465a-9ade-4db33fe04af6","name":"tag-ref-cloudloadgen"}],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.3.0"}
