{"id":"ae3a8766-d8d4-437e-b8c8-01a01c2236c2","type":"dashboard","namespaces":["default"],"attributes":{"title":"AWS Cloud Map — Service Discovery","description":"","panelsJSON":"[{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":0,\"w\":12,\"h\":5,\"i\":\"e340c59a-0998-4067-a8ca-5651c5d7a255\"},\"panelIndex\":\"e340c59a-0998-4067-a8ca-5651c5d7a255\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"8f8422be-f98f-4dd5-b3fb-2afde0cc68bc\":{\"index\":\"8f8422be-f98f-4dd5-b3fb-2afde0cc68bc\",\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | STATS `Total Operations` = COUNT()\"},\"columns\":[{\"columnId\":\"Total Operations\",\"fieldName\":\"Total Operations\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"8f8422be-f98f-4dd5-b3fb-2afde0cc68bc\",\"layerType\":\"data\",\"metricAccessor\":\"Total Operations\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":12,\"y\":0,\"w\":12,\"h\":5,\"i\":\"de4a1368-4b55-4420-bf12-bdb32b2732f7\"},\"panelIndex\":\"de4a1368-4b55-4420-bf12-bdb32b2732f7\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"f3cb052d-477d-43b5-a330-fa30ec7eccee\":{\"index\":\"f3cb052d-477d-43b5-a330-fa30ec7eccee\",\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | WHERE `aws.cloudmap.health_status` == \\\"UNHEALTHY\\\" | STATS `Unhealthy Instances` = COUNT()\"},\"columns\":[{\"columnId\":\"Unhealthy Instances\",\"fieldName\":\"Unhealthy Instances\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"f3cb052d-477d-43b5-a330-fa30ec7eccee\",\"layerType\":\"data\",\"metricAccessor\":\"Unhealthy Instances\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":0,\"w\":12,\"h\":5,\"i\":\"9a4e0498-6f0b-493d-a59e-70fa61218a58\"},\"panelIndex\":\"9a4e0498-6f0b-493d-a59e-70fa61218a58\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"2ce138ae-84f1-4b7d-bc62-359d56e9485a\":{\"index\":\"2ce138ae-84f1-4b7d-bc62-359d56e9485a\",\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | STATS avg_i = AVG(`aws.cloudmap.instances_returned`) | EVAL `Avg Instances Returned` = ROUND(avg_i, 1)\"},\"columns\":[{\"columnId\":\"Avg Instances Returned\",\"fieldName\":\"Avg Instances Returned\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"2ce138ae-84f1-4b7d-bc62-359d56e9485a\",\"layerType\":\"data\",\"metricAccessor\":\"Avg Instances Returned\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":36,\"y\":0,\"w\":12,\"h\":5,\"i\":\"51453a19-e820-4975-91b8-16be8db961f6\"},\"panelIndex\":\"51453a19-e820-4975-91b8-16be8db961f6\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"ffe20df4-8fdc-40a3-a8ec-3d33db6829cd\":{\"index\":\"ffe20df4-8fdc-40a3-a8ec-3d33db6829cd\",\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | STATS `Namespace Count` = COUNT_DISTINCT(`aws.cloudmap.namespace`)\"},\"columns\":[{\"columnId\":\"Namespace Count\",\"fieldName\":\"Namespace Count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"ffe20df4-8fdc-40a3-a8ec-3d33db6829cd\",\"layerType\":\"data\",\"metricAccessor\":\"Namespace Count\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":5,\"w\":24,\"h\":10,\"i\":\"a7000162-f758-45f6-a316-7c59032299c5\"},\"panelIndex\":\"a7000162-f758-45f6-a316-7c59032299c5\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Health Status\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"62d38be1-b609-4806-b043-65a316624ffb\":{\"index\":\"98ce90a515267507e5582b46be59adf347462c258db1aecca952d24332b8b8da\",\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | STATS count = COUNT() BY status = `aws.cloudmap.health_status` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.cloudmap*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"status\",\"fieldName\":\"status\",\"label\":\"status\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.cloudmap*\",\"sourceField\":\"status\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"98ce90a515267507e5582b46be59adf347462c258db1aecca952d24332b8b8da\",\"title\":\"logs-aws.cloudmap*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"62d38be1-b609-4806-b043-65a316624ffb\",\"primaryGroups\":[\"status\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | STATS count = COUNT() BY status = `aws.cloudmap.health_status` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"98ce90a515267507e5582b46be59adf347462c258db1aecca952d24332b8b8da\":{\"id\":\"98ce90a515267507e5582b46be59adf347462c258db1aecca952d24332b8b8da\",\"title\":\"logs-aws.cloudmap*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.cloudmap*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Health Status\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":5,\"w\":24,\"h\":10,\"i\":\"66406f01-a601-4c7a-b524-b6b73256480a\"},\"panelIndex\":\"66406f01-a601-4c7a-b524-b6b73256480a\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Query Type\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"0f9f4801-272f-4dba-be9b-e0a10f5cdb24\":{\"index\":\"98ce90a515267507e5582b46be59adf347462c258db1aecca952d24332b8b8da\",\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | STATS count = COUNT() BY query_type = `aws.cloudmap.query_type` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.cloudmap*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"query_type\",\"fieldName\":\"query_type\",\"label\":\"query_type\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.cloudmap*\",\"sourceField\":\"query_type\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"98ce90a515267507e5582b46be59adf347462c258db1aecca952d24332b8b8da\",\"title\":\"logs-aws.cloudmap*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"0f9f4801-272f-4dba-be9b-e0a10f5cdb24\",\"primaryGroups\":[\"query_type\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | STATS count = COUNT() BY query_type = `aws.cloudmap.query_type` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"98ce90a515267507e5582b46be59adf347462c258db1aecca952d24332b8b8da\":{\"id\":\"98ce90a515267507e5582b46be59adf347462c258db1aecca952d24332b8b8da\",\"title\":\"logs-aws.cloudmap*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.cloudmap*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Query Type\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":15,\"w\":48,\"h\":10,\"i\":\"b92eaf23-0df2-4a61-abfc-c5a6b580e530\"},\"panelIndex\":\"b92eaf23-0df2-4a61-abfc-c5a6b580e530\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Discovery Operations Over Time\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"e056a294-eca6-480b-a76f-05c820313c8d\":{\"index\":\"e056a294-eca6-480b-a76f-05c820313c8d\",\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | STATS count = COUNT() BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"count\",\"fieldName\":\"count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"e056a294-eca6-480b-a76f-05c820313c8d\",\"accessors\":[\"count\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"count\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Discovery Operations Over Time\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":25,\"w\":48,\"h\":10,\"i\":\"05917241-f4a4-4d9e-b2ee-b92d182637fc\"},\"panelIndex\":\"05917241-f4a4-4d9e-b2ee-b92d182637fc\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Recent Operations\",\"description\":\"\",\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"010647b0-0e50-4e81-b65a-9a507bd01f0a\":{\"index\":\"010647b0-0e50-4e81-b65a-9a507bd01f0a\",\"query\":{\"esql\":\"FROM logs-aws.cloudmap* | KEEP @timestamp, `aws.cloudmap.namespace`, `aws.cloudmap.service_name`, `aws.cloudmap.health_status`, `event.action` | SORT @timestamp DESC | LIMIT 100\"},\"columns\":[{\"columnId\":\"@timestamp\",\"fieldName\":\"@timestamp\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"aws.cloudmap.namespace\",\"fieldName\":\"aws.cloudmap.namespace\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.cloudmap.service_name\",\"fieldName\":\"aws.cloudmap.service_name\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.cloudmap.health_status\",\"fieldName\":\"aws.cloudmap.health_status\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"event.action\",\"fieldName\":\"event.action\",\"meta\":{\"type\":\"string\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"010647b0-0e50-4e81-b65a-9a507bd01f0a\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"@timestamp\",\"isTransposable\":false},{\"columnId\":\"aws.cloudmap.namespace\",\"isTransposable\":false},{\"columnId\":\"aws.cloudmap.service_name\",\"isTransposable\":false},{\"columnId\":\"aws.cloudmap.health_status\",\"isTransposable\":false},{\"columnId\":\"event.action\",\"isTransposable\":false}],\"rowHeight\":\"auto\",\"rowHeightLines\":1},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Recent Operations\"}]","optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","timeRestore":true,"timeFrom":"now-24h","timeTo":"now","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"}},"references":[],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.3.0"}
