{"id":"74675dbd-10f8-465a-9ade-4db33fe04af6","type":"tag","namespaces":["default"],"attributes":{"name":"cloudloadgen","description":"Installed by Cloud to Elastic Load Generator — filter this tag in Kibana to find or remove these assets."},"references":[],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"8.0.0"}
{"id":"24584783-9186-4e4b-9bf1-bcebe96c9e43","type":"dashboard","namespaces":["default"],"attributes":{"title":"Amazon DynamoDB DAX — Cache Performance","description":"","panelsJSON":"[{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":0,\"w\":12,\"h\":5,\"i\":\"75d575da-7306-4f37-abaa-cf3860d66b63\"},\"panelIndex\":\"75d575da-7306-4f37-abaa-cf3860d66b63\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"13277ecf-58a1-43cf-8dd2-81457ad52af2\":{\"index\":\"13277ecf-58a1-43cf-8dd2-81457ad52af2\",\"query\":{\"esql\":\"FROM logs-aws.dax* | STATS `Total Requests` = COUNT()\"},\"columns\":[{\"columnId\":\"Total Requests\",\"fieldName\":\"Total Requests\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"13277ecf-58a1-43cf-8dd2-81457ad52af2\",\"layerType\":\"data\",\"metricAccessor\":\"Total Requests\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":12,\"y\":0,\"w\":12,\"h\":5,\"i\":\"e94502b8-5b71-4a65-9ffd-d9f491476b2e\"},\"panelIndex\":\"e94502b8-5b71-4a65-9ffd-d9f491476b2e\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"a6d88768-1829-4a4d-98cb-12013d7da560\":{\"index\":\"a6d88768-1829-4a4d-98cb-12013d7da560\",\"query\":{\"esql\":\"FROM logs-aws.dax* | STATS total = COUNT(), hits = COUNT_IF(`event.action` == \\\"cache-hit\\\") | EVAL `Cache Hit Rate (%)` = ROUND(hits * 100.0 / total, 1)\"},\"columns\":[{\"columnId\":\"Cache Hit Rate (%)\",\"fieldName\":\"Cache Hit Rate (%)\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"a6d88768-1829-4a4d-98cb-12013d7da560\",\"layerType\":\"data\",\"metricAccessor\":\"Cache Hit Rate (%)\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":0,\"w\":12,\"h\":5,\"i\":\"33cb0eb3-6970-4a95-ab5b-823c23e44776\"},\"panelIndex\":\"33cb0eb3-6970-4a95-ab5b-823c23e44776\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"8606d053-8e7c-40aa-8b13-e493b811a0a4\":{\"index\":\"8606d053-8e7c-40aa-8b13-e493b811a0a4\",\"query\":{\"esql\":\"FROM logs-aws.dax* | STATS avg_l = AVG(`aws.dax.request_latency_ms`) | EVAL `Avg Latency (ms)` = ROUND(avg_l, 0)\"},\"columns\":[{\"columnId\":\"Avg Latency (ms)\",\"fieldName\":\"Avg Latency (ms)\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"8606d053-8e7c-40aa-8b13-e493b811a0a4\",\"layerType\":\"data\",\"metricAccessor\":\"Avg Latency (ms)\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":36,\"y\":0,\"w\":12,\"h\":5,\"i\":\"1a690504-9d14-44cc-86fb-7e304715ddfe\"},\"panelIndex\":\"1a690504-9d14-44cc-86fb-7e304715ddfe\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"2be72935-ff41-44a3-8924-5982ee1c96dd\":{\"index\":\"2be72935-ff41-44a3-8924-5982ee1c96dd\",\"query\":{\"esql\":\"FROM logs-aws.dax* | WHERE `log.level` == \\\"failure\\\" | STATS `Error Count` = COUNT()\"},\"columns\":[{\"columnId\":\"Error Count\",\"fieldName\":\"Error Count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"2be72935-ff41-44a3-8924-5982ee1c96dd\",\"layerType\":\"data\",\"metricAccessor\":\"Error Count\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":5,\"w\":24,\"h\":10,\"i\":\"1d1e4543-ba42-4135-9e14-f71baaccf86b\"},\"panelIndex\":\"1d1e4543-ba42-4135-9e14-f71baaccf86b\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Cache Result\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"40fb5555-31ae-459a-8b36-5ba07aac79cd\":{\"index\":\"637762ade3d2c3a3f65676e2018125da5027bbb5e15e3bc09245e790d25c4168\",\"query\":{\"esql\":\"FROM logs-aws.dax* | STATS count = COUNT() BY result = `event.action` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.dax*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"result\",\"fieldName\":\"result\",\"label\":\"result\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.dax*\",\"sourceField\":\"result\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"637762ade3d2c3a3f65676e2018125da5027bbb5e15e3bc09245e790d25c4168\",\"title\":\"logs-aws.dax*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"40fb5555-31ae-459a-8b36-5ba07aac79cd\",\"primaryGroups\":[\"result\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.dax* | STATS count = COUNT() BY result = `event.action` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"637762ade3d2c3a3f65676e2018125da5027bbb5e15e3bc09245e790d25c4168\":{\"id\":\"637762ade3d2c3a3f65676e2018125da5027bbb5e15e3bc09245e790d25c4168\",\"title\":\"logs-aws.dax*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.dax*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Cache Result\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":5,\"w\":24,\"h\":10,\"i\":\"14a50e5a-90df-4320-a00a-31e1dfd27188\"},\"panelIndex\":\"14a50e5a-90df-4320-a00a-31e1dfd27188\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Operation Type\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"d58f3ab9-3d6d-42ed-850f-c5866bf6dc1a\":{\"index\":\"637762ade3d2c3a3f65676e2018125da5027bbb5e15e3bc09245e790d25c4168\",\"query\":{\"esql\":\"FROM logs-aws.dax* | STATS count = COUNT() BY operation = `aws.dax.operation` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.dax*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"operation\",\"fieldName\":\"operation\",\"label\":\"operation\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.dax*\",\"sourceField\":\"operation\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"637762ade3d2c3a3f65676e2018125da5027bbb5e15e3bc09245e790d25c4168\",\"title\":\"logs-aws.dax*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"d58f3ab9-3d6d-42ed-850f-c5866bf6dc1a\",\"primaryGroups\":[\"operation\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.dax* | STATS count = COUNT() BY operation = `aws.dax.operation` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"637762ade3d2c3a3f65676e2018125da5027bbb5e15e3bc09245e790d25c4168\":{\"id\":\"637762ade3d2c3a3f65676e2018125da5027bbb5e15e3bc09245e790d25c4168\",\"title\":\"logs-aws.dax*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.dax*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Operation Type\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":15,\"w\":48,\"h\":10,\"i\":\"37c98c60-ea75-435b-aaf9-83f9e8b55bcc\"},\"panelIndex\":\"37c98c60-ea75-435b-aaf9-83f9e8b55bcc\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Request Rate Over Time\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"dfdaf5c8-aa48-4a6f-9ce1-c96325bcfa84\":{\"index\":\"dfdaf5c8-aa48-4a6f-9ce1-c96325bcfa84\",\"query\":{\"esql\":\"FROM logs-aws.dax* | STATS count = COUNT() BY bucket = BUCKET(`@timestamp`, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"count\",\"fieldName\":\"count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"dfdaf5c8-aa48-4a6f-9ce1-c96325bcfa84\",\"accessors\":[\"count\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"count\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Request Rate Over Time\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":25,\"w\":48,\"h\":10,\"i\":\"55d9fe48-0a52-498c-87c7-cdfc23761168\"},\"panelIndex\":\"55d9fe48-0a52-498c-87c7-cdfc23761168\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Recent Requests\",\"description\":\"\",\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"535ca197-6426-4503-8ae6-5c9e8c2258d3\":{\"index\":\"535ca197-6426-4503-8ae6-5c9e8c2258d3\",\"query\":{\"esql\":\"FROM logs-aws.dax* | KEEP `@timestamp`, `aws.dax.cluster_name`, `aws.dax.operation`, `aws.dax.request_latency_ms`, `log.level` | SORT `@timestamp` DESC | LIMIT 100\"},\"columns\":[{\"columnId\":\"`@timestamp`\",\"fieldName\":\"`@timestamp`\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.dax.cluster_name\",\"fieldName\":\"aws.dax.cluster_name\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.dax.operation\",\"fieldName\":\"aws.dax.operation\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.dax.request_latency_ms\",\"fieldName\":\"aws.dax.request_latency_ms\",\"meta\":{\"type\":\"number\"}},{\"columnId\":\"log.level\",\"fieldName\":\"log.level\",\"meta\":{\"type\":\"string\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"535ca197-6426-4503-8ae6-5c9e8c2258d3\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"`@timestamp`\",\"isTransposable\":false},{\"columnId\":\"aws.dax.cluster_name\",\"isTransposable\":false},{\"columnId\":\"aws.dax.operation\",\"isTransposable\":false},{\"columnId\":\"aws.dax.request_latency_ms\",\"isTransposable\":false},{\"columnId\":\"log.level\",\"isTransposable\":false}],\"rowHeight\":\"auto\",\"rowHeightLines\":1},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Recent Requests\"}]","optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","timeRestore":true,"timeFrom":"now-24h","timeTo":"now","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"}},"references":[{"type":"tag","id":"74675dbd-10f8-465a-9ade-4db33fe04af6","name":"tag-ref-cloudloadgen"}],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.3.0"}
