{"id":"bbb34a4d-62ff-487a-a7e5-0583e989c930","type":"dashboard","namespaces":["default"],"attributes":{"title":"AWS Proton — Infrastructure Deployments","description":"","panelsJSON":"[{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":0,\"w\":12,\"h\":5,\"i\":\"56f77177-f9a0-4e7c-a948-70833e55c20c\"},\"panelIndex\":\"56f77177-f9a0-4e7c-a948-70833e55c20c\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"ba94d6e8-22a6-41e7-a2a8-afad381e45ed\":{\"index\":\"ba94d6e8-22a6-41e7-a2a8-afad381e45ed\",\"query\":{\"esql\":\"FROM logs-aws.proton* | STATS `Total Deployments` = COUNT()\"},\"columns\":[{\"columnId\":\"Total Deployments\",\"fieldName\":\"Total Deployments\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"ba94d6e8-22a6-41e7-a2a8-afad381e45ed\",\"layerType\":\"data\",\"metricAccessor\":\"Total Deployments\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":12,\"y\":0,\"w\":12,\"h\":5,\"i\":\"48bc370c-2420-4f72-8243-1f8ad63606eb\"},\"panelIndex\":\"48bc370c-2420-4f72-8243-1f8ad63606eb\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"ae3acdb7-2d4d-49e9-93ef-e1eb5c7e01e4\":{\"index\":\"ae3acdb7-2d4d-49e9-93ef-e1eb5c7e01e4\",\"query\":{\"esql\":\"FROM logs-aws.proton* | WHERE `aws.proton.deployment_status` == \\\"FAILED\\\" | STATS `Failed Deployments` = COUNT()\"},\"columns\":[{\"columnId\":\"Failed Deployments\",\"fieldName\":\"Failed Deployments\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"ae3acdb7-2d4d-49e9-93ef-e1eb5c7e01e4\",\"layerType\":\"data\",\"metricAccessor\":\"Failed Deployments\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":0,\"w\":12,\"h\":5,\"i\":\"fc46180a-ab6d-4762-980a-b7f78ab20967\"},\"panelIndex\":\"fc46180a-ab6d-4762-980a-b7f78ab20967\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"b8cf4485-e120-4bae-a2d3-71ee7bd9be91\":{\"index\":\"b8cf4485-e120-4bae-a2d3-71ee7bd9be91\",\"query\":{\"esql\":\"FROM logs-aws.proton* | STATS `Environments Active` = COUNT_DISTINCT(`aws.proton.environment_name`)\"},\"columns\":[{\"columnId\":\"Environments Active\",\"fieldName\":\"Environments Active\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"b8cf4485-e120-4bae-a2d3-71ee7bd9be91\",\"layerType\":\"data\",\"metricAccessor\":\"Environments Active\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":36,\"y\":0,\"w\":12,\"h\":5,\"i\":\"8b624e9a-8de3-46fb-ae46-889ecb031cf6\"},\"panelIndex\":\"8b624e9a-8de3-46fb-ae46-889ecb031cf6\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"fa815df6-c1e4-4159-9f5c-cb3404e2aea9\":{\"index\":\"fa815df6-c1e4-4159-9f5c-cb3404e2aea9\",\"query\":{\"esql\":\"FROM logs-aws.proton* | STATS `Services Deployed` = COUNT_DISTINCT(`aws.proton.service_name`)\"},\"columns\":[{\"columnId\":\"Services Deployed\",\"fieldName\":\"Services Deployed\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"fa815df6-c1e4-4159-9f5c-cb3404e2aea9\",\"layerType\":\"data\",\"metricAccessor\":\"Services Deployed\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":5,\"w\":24,\"h\":10,\"i\":\"138d8181-c6e1-4fe3-b7e6-ca7f3ae3ef74\"},\"panelIndex\":\"138d8181-c6e1-4fe3-b7e6-ca7f3ae3ef74\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Deployment Status\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"d6f7f577-f52c-4941-a92a-b56c65051fd1\":{\"index\":\"660f110e0602583945083b990d83a3b12742ec040d2824720c374acac1f7be39\",\"query\":{\"esql\":\"FROM logs-aws.proton* | STATS count = COUNT() BY status = `aws.proton.deployment_status` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.proton*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"status\",\"fieldName\":\"status\",\"label\":\"status\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.proton*\",\"sourceField\":\"status\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"660f110e0602583945083b990d83a3b12742ec040d2824720c374acac1f7be39\",\"title\":\"logs-aws.proton*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"d6f7f577-f52c-4941-a92a-b56c65051fd1\",\"primaryGroups\":[\"status\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.proton* | STATS count = COUNT() BY status = `aws.proton.deployment_status` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"660f110e0602583945083b990d83a3b12742ec040d2824720c374acac1f7be39\":{\"id\":\"660f110e0602583945083b990d83a3b12742ec040d2824720c374acac1f7be39\",\"title\":\"logs-aws.proton*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.proton*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Deployment Status\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":5,\"w\":24,\"h\":10,\"i\":\"30a88d55-769f-4db8-a85b-fe8bcd81691a\"},\"panelIndex\":\"30a88d55-769f-4db8-a85b-fe8bcd81691a\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Component Type\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"1dc1d936-45eb-47fb-b2c8-3c5708c698a4\":{\"index\":\"660f110e0602583945083b990d83a3b12742ec040d2824720c374acac1f7be39\",\"query\":{\"esql\":\"FROM logs-aws.proton* | STATS count = COUNT() BY component = `aws.proton.component` | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.proton*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"component\",\"fieldName\":\"component\",\"label\":\"component\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.proton*\",\"sourceField\":\"component\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"660f110e0602583945083b990d83a3b12742ec040d2824720c374acac1f7be39\",\"title\":\"logs-aws.proton*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"1dc1d936-45eb-47fb-b2c8-3c5708c698a4\",\"primaryGroups\":[\"component\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.proton* | STATS count = COUNT() BY component = `aws.proton.component` | SORT count DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"660f110e0602583945083b990d83a3b12742ec040d2824720c374acac1f7be39\":{\"id\":\"660f110e0602583945083b990d83a3b12742ec040d2824720c374acac1f7be39\",\"title\":\"logs-aws.proton*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.proton*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Component Type\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":15,\"w\":48,\"h\":10,\"i\":\"1b50a055-67b4-4846-9a41-b6f8c17c51e4\"},\"panelIndex\":\"1b50a055-67b4-4846-9a41-b6f8c17c51e4\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Deployments Over Time\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"b974dd5d-a042-45b1-960a-6c5a667487a7\":{\"index\":\"b974dd5d-a042-45b1-960a-6c5a667487a7\",\"query\":{\"esql\":\"FROM logs-aws.proton* | STATS count = COUNT() BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"count\",\"fieldName\":\"count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"b974dd5d-a042-45b1-960a-6c5a667487a7\",\"accessors\":[\"count\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"count\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Deployments Over Time\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":25,\"w\":48,\"h\":10,\"i\":\"c3279aa0-9f6c-4fb1-beb7-a735269798ee\"},\"panelIndex\":\"c3279aa0-9f6c-4fb1-beb7-a735269798ee\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Recent Deployments\",\"description\":\"\",\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"be94fe31-e475-47dc-baf4-35c2fddd57e9\":{\"index\":\"be94fe31-e475-47dc-baf4-35c2fddd57e9\",\"query\":{\"esql\":\"FROM logs-aws.proton* | KEEP @timestamp, `aws.proton.environment_name`, `aws.proton.service_name`, `aws.proton.deployment_status`, `event.action` | SORT @timestamp DESC | LIMIT 100\"},\"columns\":[{\"columnId\":\"@timestamp\",\"fieldName\":\"@timestamp\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"aws.proton.environment_name\",\"fieldName\":\"aws.proton.environment_name\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.proton.service_name\",\"fieldName\":\"aws.proton.service_name\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.proton.deployment_status\",\"fieldName\":\"aws.proton.deployment_status\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"event.action\",\"fieldName\":\"event.action\",\"meta\":{\"type\":\"string\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"be94fe31-e475-47dc-baf4-35c2fddd57e9\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"@timestamp\",\"isTransposable\":false},{\"columnId\":\"aws.proton.environment_name\",\"isTransposable\":false},{\"columnId\":\"aws.proton.service_name\",\"isTransposable\":false},{\"columnId\":\"aws.proton.deployment_status\",\"isTransposable\":false},{\"columnId\":\"event.action\",\"isTransposable\":false}],\"rowHeight\":\"auto\",\"rowHeightLines\":1},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Recent Deployments\"}]","optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","timeRestore":true,"timeFrom":"now-24h","timeTo":"now","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"}},"references":[],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.3.0"}
