{"id":"eb90740d-e8ba-4bf8-8f4a-a96507607cf1","type":"dashboard","namespaces":["default"],"attributes":{"title":"AWS SageMaker — Endpoints & Training","description":"","panelsJSON":"[{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":0,\"w\":12,\"h\":5,\"i\":\"f0f1e35c-df3e-446b-a4e8-9a7938deee61\"},\"panelIndex\":\"f0f1e35c-df3e-446b-a4e8-9a7938deee61\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"e867bb30-43a7-4295-aff5-f5117a5237dd\":{\"index\":\"e867bb30-43a7-4295-aff5-f5117a5237dd\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS `Total Invocations` = SUM(`aws.sagemaker.cloudwatch_metrics.Invocations.sum`)\"},\"columns\":[{\"columnId\":\"Total Invocations\",\"fieldName\":\"Total Invocations\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"e867bb30-43a7-4295-aff5-f5117a5237dd\",\"layerType\":\"data\",\"metricAccessor\":\"Total Invocations\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":12,\"y\":0,\"w\":12,\"h\":5,\"i\":\"3a92bc82-f692-4670-adfa-361e3dc80b6e\"},\"panelIndex\":\"3a92bc82-f692-4670-adfa-361e3dc80b6e\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"6ce710db-c04c-44d5-8a50-bcdaf1f81ad9\":{\"index\":\"6ce710db-c04c-44d5-8a50-bcdaf1f81ad9\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS `Avg Latency (ms)` = AVG(`aws.sagemaker.cloudwatch_metrics.ModelLatency.avg`)\"},\"columns\":[{\"columnId\":\"Avg Latency (ms)\",\"fieldName\":\"Avg Latency (ms)\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"6ce710db-c04c-44d5-8a50-bcdaf1f81ad9\",\"layerType\":\"data\",\"metricAccessor\":\"Avg Latency (ms)\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":0,\"w\":12,\"h\":5,\"i\":\"bc8697eb-a068-42e3-98a7-1f0d64641909\"},\"panelIndex\":\"bc8697eb-a068-42e3-98a7-1f0d64641909\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"209dad5e-eac1-4a0c-b06f-c3b56895de8d\":{\"index\":\"209dad5e-eac1-4a0c-b06f-c3b56895de8d\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS `Total 4xx Errors` = SUM(`aws.sagemaker.cloudwatch_metrics.Invocations4XXError.sum`)\"},\"columns\":[{\"columnId\":\"Total 4xx Errors\",\"fieldName\":\"Total 4xx Errors\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"209dad5e-eac1-4a0c-b06f-c3b56895de8d\",\"layerType\":\"data\",\"metricAccessor\":\"Total 4xx Errors\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":36,\"y\":0,\"w\":12,\"h\":5,\"i\":\"d83dc5ea-9a9d-48df-8451-d0d45cca4746\"},\"panelIndex\":\"d83dc5ea-9a9d-48df-8451-d0d45cca4746\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"6566e6ab-1f05-43e9-924e-29f6580dc680\":{\"index\":\"6566e6ab-1f05-43e9-924e-29f6580dc680\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS `Total 5xx Errors` = SUM(`aws.sagemaker.cloudwatch_metrics.Invocations5XXError.sum`)\"},\"columns\":[{\"columnId\":\"Total 5xx Errors\",\"fieldName\":\"Total 5xx Errors\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"6566e6ab-1f05-43e9-924e-29f6580dc680\",\"layerType\":\"data\",\"metricAccessor\":\"Total 5xx Errors\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":5,\"w\":24,\"h\":10,\"i\":\"a33526e7-3184-4c46-8a5a-bb897fe6bcee\"},\"panelIndex\":\"a33526e7-3184-4c46-8a5a-bb897fe6bcee\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Invocations Over Time\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"672947c1-5bbc-4421-93c3-5f0f0fe955fe\":{\"index\":\"672947c1-5bbc-4421-93c3-5f0f0fe955fe\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS invocations = SUM(`aws.sagemaker.cloudwatch_metrics.Invocations.sum`) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"invocations\",\"fieldName\":\"invocations\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"area\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"672947c1-5bbc-4421-93c3-5f0f0fe955fe\",\"accessors\":[\"invocations\"],\"seriesType\":\"area\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"invocations\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Invocations Over Time\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":5,\"w\":24,\"h\":10,\"i\":\"26213c83-fbaa-447f-8460-92de11f457d5\"},\"panelIndex\":\"26213c83-fbaa-447f-8460-92de11f457d5\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Model Latency (avg ms)\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"7fe4c6da-f3cc-44b0-834e-13dd109ecc3c\":{\"index\":\"7fe4c6da-f3cc-44b0-834e-13dd109ecc3c\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS avg_latency = AVG(`aws.sagemaker.cloudwatch_metrics.ModelLatency.avg`) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"avg_latency\",\"fieldName\":\"avg_latency\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"7fe4c6da-f3cc-44b0-834e-13dd109ecc3c\",\"accessors\":[\"avg_latency\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"avg_latency\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Model Latency (avg ms)\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":15,\"w\":24,\"h\":10,\"i\":\"4d16db09-47f1-4491-a0de-0ae63ab2d342\"},\"panelIndex\":\"4d16db09-47f1-4491-a0de-0ae63ab2d342\",\"embeddableConfig\":{\"attributes\":{\"title\":\"4xx / 5xx Errors Over Time\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"e778fa3c-747a-44aa-b32f-8fbe946d8918\":{\"index\":\"e778fa3c-747a-44aa-b32f-8fbe946d8918\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS errors_4xx = SUM(`aws.sagemaker.cloudwatch_metrics.Invocations4XXError.sum`), errors_5xx = SUM(`aws.sagemaker.cloudwatch_metrics.Invocations5XXError.sum`) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"errors_4xx\",\"fieldName\":\"errors_4xx\",\"meta\":{\"type\":\"number\"}},{\"columnId\":\"errors_5xx\",\"fieldName\":\"errors_5xx\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"e778fa3c-747a-44aa-b32f-8fbe946d8918\",\"accessors\":[\"errors_4xx\",\"errors_5xx\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"errors_4xx\",\"axisMode\":\"left\"},{\"forAccessor\":\"errors_5xx\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"4xx / 5xx Errors Over Time\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":15,\"w\":24,\"h\":10,\"i\":\"5fa33962-e7ec-4f6b-84e7-ca1bccdd61ee\"},\"panelIndex\":\"5fa33962-e7ec-4f6b-84e7-ca1bccdd61ee\",\"embeddableConfig\":{\"attributes\":{\"title\":\"GPU / CPU Utilization (%)\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"3ec21b2b-10ea-4d34-b98d-eb2ee971aab8\":{\"index\":\"3ec21b2b-10ea-4d34-b98d-eb2ee971aab8\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS gpu = AVG(`aws.sagemaker.cloudwatch_metrics.GPUUtilization.avg`), cpu = AVG(`aws.sagemaker.cloudwatch_metrics.CPUUtilization.avg`) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"gpu\",\"fieldName\":\"gpu\",\"meta\":{\"type\":\"number\"}},{\"columnId\":\"cpu\",\"fieldName\":\"cpu\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"3ec21b2b-10ea-4d34-b98d-eb2ee971aab8\",\"accessors\":[\"gpu\",\"cpu\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"gpu\",\"axisMode\":\"left\"},{\"forAccessor\":\"cpu\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"GPU / CPU Utilization (%)\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":25,\"w\":16,\"h\":10,\"i\":\"65f32be0-0572-4b37-bdec-369ce9a2f874\"},\"panelIndex\":\"65f32be0-0572-4b37-bdec-369ce9a2f874\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Job Outcomes\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"b8096de5-6622-42a8-8e39-4a8afd6a7cc1\":{\"index\":\"a48d5cc9010ef48410cb04f2ad7543f2cad74a3b3ee787d0ef2f1f01dca7a276\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS count = COUNT() BY outcome = event.outcome\"},\"columns\":[{\"columnId\":\"count\",\"fieldName\":\"count\",\"label\":\"count\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.sagemaker*\",\"sourceField\":\"count\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"outcome\",\"fieldName\":\"outcome\",\"label\":\"outcome\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.sagemaker*\",\"sourceField\":\"outcome\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"a48d5cc9010ef48410cb04f2ad7543f2cad74a3b3ee787d0ef2f1f01dca7a276\",\"title\":\"logs-aws.sagemaker*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"b8096de5-6622-42a8-8e39-4a8afd6a7cc1\",\"primaryGroups\":[\"outcome\"],\"metrics\":[\"count\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS count = COUNT() BY outcome = event.outcome\"},\"filters\":[],\"adHocDataViews\":{\"a48d5cc9010ef48410cb04f2ad7543f2cad74a3b3ee787d0ef2f1f01dca7a276\":{\"id\":\"a48d5cc9010ef48410cb04f2ad7543f2cad74a3b3ee787d0ef2f1f01dca7a276\",\"title\":\"logs-aws.sagemaker*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.sagemaker*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Job Outcomes\"},{\"type\":\"lens\",\"gridData\":{\"x\":16,\"y\":25,\"w\":32,\"h\":10,\"i\":\"b4e4c8be-ed94-4b9a-99ee-903845be9df1\"},\"panelIndex\":\"b4e4c8be-ed94-4b9a-99ee-903845be9df1\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Events by Job Type\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"85216499-8306-4ef4-bb47-751ca62daaa6\":{\"index\":\"85216499-8306-4ef4-bb47-751ca62daaa6\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS count = COUNT() BY job_type = `aws.sagemaker.job.type` | SORT count DESC\"},\"columns\":[{\"columnId\":\"job_type\",\"fieldName\":\"job_type\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"count\",\"fieldName\":\"count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"bar_horizontal\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"85216499-8306-4ef4-bb47-751ca62daaa6\",\"accessors\":[\"count\"],\"seriesType\":\"bar_horizontal\",\"xAccessor\":\"job_type\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"count\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Events by Job Type\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":35,\"w\":24,\"h\":10,\"i\":\"8ca8d1cd-5d80-4511-b432-c1068f42923b\"},\"panelIndex\":\"8ca8d1cd-5d80-4511-b432-c1068f42923b\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Events by Action\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"3beffafc-5e54-4180-9b16-28c38e52dc6f\":{\"index\":\"3beffafc-5e54-4180-9b16-28c38e52dc6f\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | STATS count = COUNT() BY action = event.action | SORT count DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"action\",\"fieldName\":\"action\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"count\",\"fieldName\":\"count\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"bar_horizontal\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"3beffafc-5e54-4180-9b16-28c38e52dc6f\",\"accessors\":[\"count\"],\"seriesType\":\"bar_horizontal\",\"xAccessor\":\"action\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"count\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Events by Action\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":35,\"w\":24,\"h\":10,\"i\":\"c76715ad-8c8d-41e9-8020-e4e985be3abd\"},\"panelIndex\":\"c76715ad-8c8d-41e9-8020-e4e985be3abd\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Training Loss & Accuracy\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"a12c23ed-3b7a-4003-9359-e7d118554090\":{\"index\":\"a12c23ed-3b7a-4003-9359-e7d118554090\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | WHERE `aws.sagemaker.job.type` == \\\"Training\\\" | STATS avg_loss = AVG(`aws.sagemaker.metrics.training_loss`), avg_acc = AVG(`aws.sagemaker.metrics.accuracy`) BY bucket = BUCKET(@timestamp, 75, ?_tstart, ?_tend) | SORT bucket\"},\"columns\":[{\"columnId\":\"bucket\",\"fieldName\":\"bucket\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"avg_loss\",\"fieldName\":\"avg_loss\",\"meta\":{\"type\":\"number\"}},{\"columnId\":\"avg_acc\",\"fieldName\":\"avg_acc\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"a12c23ed-3b7a-4003-9359-e7d118554090\",\"accessors\":[\"avg_loss\",\"avg_acc\"],\"seriesType\":\"line\",\"xAccessor\":\"bucket\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"avg_loss\",\"axisMode\":\"left\"},{\"forAccessor\":\"avg_acc\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Training Loss & Accuracy\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":45,\"w\":48,\"h\":12,\"i\":\"d77dd375-c8d7-4ecf-8c56-1375380ac727\"},\"panelIndex\":\"d77dd375-c8d7-4ecf-8c56-1375380ac727\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Recent SageMaker Events\",\"description\":\"\",\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"301215d4-7b00-420d-8f18-8d0ff837790e\":{\"index\":\"301215d4-7b00-420d-8f18-8d0ff837790e\",\"query\":{\"esql\":\"FROM logs-aws.sagemaker* | KEEP @timestamp, `aws.sagemaker.job.name`, `aws.sagemaker.job.type`, event.action, event.outcome, event.duration | SORT @timestamp DESC | LIMIT 100\"},\"columns\":[{\"columnId\":\"@timestamp\",\"fieldName\":\"@timestamp\",\"meta\":{\"type\":\"date\"}},{\"columnId\":\"aws.sagemaker.job.name\",\"fieldName\":\"aws.sagemaker.job.name\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.sagemaker.job.type\",\"fieldName\":\"aws.sagemaker.job.type\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"event.action\",\"fieldName\":\"event.action\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"event.outcome\",\"fieldName\":\"event.outcome\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"event.duration\",\"fieldName\":\"event.duration\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"301215d4-7b00-420d-8f18-8d0ff837790e\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"@timestamp\",\"isTransposable\":false},{\"columnId\":\"aws.sagemaker.job.name\",\"isTransposable\":false},{\"columnId\":\"aws.sagemaker.job.type\",\"isTransposable\":false},{\"columnId\":\"event.action\",\"isTransposable\":false},{\"columnId\":\"event.outcome\",\"isTransposable\":false},{\"columnId\":\"event.duration\",\"isTransposable\":false}],\"rowHeight\":\"auto\",\"rowHeightLines\":1},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Recent SageMaker Events\"}]","optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","timeRestore":true,"timeFrom":"now-24h","timeTo":"now","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"}},"references":[],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.3.0"}
