{"id":"74675dbd-10f8-465a-9ade-4db33fe04af6","type":"tag","namespaces":["default"],"attributes":{"name":"cloudloadgen","description":"Installed by Cloud to Elastic Load Generator — filter this tag in Kibana to find or remove these assets."},"references":[],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"8.0.0"}
{"id":"9066534b-7aa7-4b8c-8e47-8e81bf6641d9","type":"dashboard","namespaces":["default"],"attributes":{"title":"AWS WAFv2 — Rules & Blocks","description":"","panelsJSON":"[{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":0,\"w\":12,\"h\":5,\"i\":\"6ea089eb-2116-459c-969b-65d9fa244b13\"},\"panelIndex\":\"6ea089eb-2116-459c-969b-65d9fa244b13\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"d5f35ce4-8ba4-4767-b52a-cdf8dd7caeb9\":{\"index\":\"d5f35ce4-8ba4-4767-b52a-cdf8dd7caeb9\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS Events = COUNT()\"},\"columns\":[{\"columnId\":\"Events\",\"fieldName\":\"Events\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"d5f35ce4-8ba4-4767-b52a-cdf8dd7caeb9\",\"layerType\":\"data\",\"metricAccessor\":\"Events\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":12,\"y\":0,\"w\":12,\"h\":5,\"i\":\"f364c294-0319-4e61-a14a-659630a99d99\"},\"panelIndex\":\"f364c294-0319-4e61-a14a-659630a99d99\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"7709e4da-6f7f-4ba9-bb22-c4c17702c156\":{\"index\":\"7709e4da-6f7f-4ba9-bb22-c4c17702c156\",\"query\":{\"esql\":\"FROM logs-aws.waf* | EVAL b = CASE(event.action == \\\"block\\\", 1, 0) | STATS m = AVG(b) | EVAL `Blocked %` = ROUND(m * 100, 1)\"},\"columns\":[{\"columnId\":\"Blocked %\",\"fieldName\":\"Blocked %\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"7709e4da-6f7f-4ba9-bb22-c4c17702c156\",\"layerType\":\"data\",\"metricAccessor\":\"Blocked %\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":0,\"w\":12,\"h\":5,\"i\":\"2260c4df-a617-4143-8c1a-bc82571c3a46\"},\"panelIndex\":\"2260c4df-a617-4143-8c1a-bc82571c3a46\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"d0c48baf-69d5-4fc2-b6b1-3aaaa271bc59\":{\"index\":\"d0c48baf-69d5-4fc2-b6b1-3aaaa271bc59\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS `Blocked` = SUM(`aws.waf.metrics.BlockedRequests.sum`)\"},\"columns\":[{\"columnId\":\"Blocked (sum)\",\"fieldName\":\"Blocked (sum)\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"d0c48baf-69d5-4fc2-b6b1-3aaaa271bc59\",\"layerType\":\"data\",\"metricAccessor\":\"Blocked (sum)\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":36,\"y\":0,\"w\":12,\"h\":5,\"i\":\"973deb5f-7eb5-4bd0-a0ce-68adbb1a293c\"},\"panelIndex\":\"973deb5f-7eb5-4bd0-a0ce-68adbb1a293c\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"description\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"3daa3670-c523-456e-8bb9-e415eeb4eda0\":{\"index\":\"3daa3670-c523-456e-8bb9-e415eeb4eda0\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS `Allowed` = SUM(`aws.waf.metrics.AllowedRequests.sum`)\"},\"columns\":[{\"columnId\":\"Allowed (sum)\",\"fieldName\":\"Allowed (sum)\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"3daa3670-c523-456e-8bb9-e415eeb4eda0\",\"layerType\":\"data\",\"metricAccessor\":\"Allowed (sum)\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":5,\"w\":16,\"h\":10,\"i\":\"79052554-4958-4242-bdaa-875943a71451\"},\"panelIndex\":\"79052554-4958-4242-bdaa-875943a71451\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Action\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"d722bbd7-f6e8-43b7-8c01-a335f9211a88\":{\"index\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS c = COUNT() BY a = event.action | SORT c DESC\"},\"columns\":[{\"columnId\":\"c\",\"fieldName\":\"c\",\"label\":\"c\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.waf*\",\"sourceField\":\"c\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"a\",\"fieldName\":\"a\",\"label\":\"a\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.waf*\",\"sourceField\":\"a\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"title\":\"logs-aws.waf*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"d722bbd7-f6e8-43b7-8c01-a335f9211a88\",\"primaryGroups\":[\"a\"],\"metrics\":[\"c\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS c = COUNT() BY a = event.action | SORT c DESC\"},\"filters\":[],\"adHocDataViews\":{\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\":{\"id\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"title\":\"logs-aws.waf*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.waf*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Action\"},{\"type\":\"lens\",\"gridData\":{\"x\":16,\"y\":5,\"w\":16,\"h\":10,\"i\":\"a44a7343-da0e-45ba-aeaf-d574a5b373c9\"},\"panelIndex\":\"a44a7343-da0e-45ba-aeaf-d574a5b373c9\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Terminating rule\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"983d6820-89ce-46c6-8d25-e7c2e5b13475\":{\"index\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS c = COUNT() BY r = `aws.waf.terminatingRuleId` | SORT c DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"c\",\"fieldName\":\"c\",\"label\":\"c\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.waf*\",\"sourceField\":\"c\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"r\",\"fieldName\":\"r\",\"label\":\"r\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.waf*\",\"sourceField\":\"r\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"title\":\"logs-aws.waf*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"983d6820-89ce-46c6-8d25-e7c2e5b13475\",\"primaryGroups\":[\"r\"],\"metrics\":[\"c\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS c = COUNT() BY r = `aws.waf.terminatingRuleId` | SORT c DESC | LIMIT 10\"},\"filters\":[],\"adHocDataViews\":{\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\":{\"id\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"title\":\"logs-aws.waf*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.waf*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Terminating rule\"},{\"type\":\"lens\",\"gridData\":{\"x\":32,\"y\":5,\"w\":16,\"h\":10,\"i\":\"d979ddd2-daf8-4452-9116-dbad51acfa65\"},\"panelIndex\":\"d979ddd2-daf8-4452-9116-dbad51acfa65\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Outcome\",\"description\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"version\":2,\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"6a750dcd-fe8a-4ccf-bbd2-77301767e22d\":{\"index\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS c = COUNT() BY o = event.outcome | SORT c DESC\"},\"columns\":[{\"columnId\":\"c\",\"fieldName\":\"c\",\"label\":\"c\",\"customLabel\":false,\"meta\":{\"type\":\"number\",\"esType\":\"long\",\"sourceParams\":{\"indexPattern\":\"logs-aws.waf*\",\"sourceField\":\"c\"},\"params\":{\"id\":\"number\"}},\"inMetricDimension\":true},{\"columnId\":\"o\",\"fieldName\":\"o\",\"label\":\"o\",\"customLabel\":false,\"meta\":{\"type\":\"string\",\"esType\":\"text\",\"sourceParams\":{\"indexPattern\":\"logs-aws.waf*\",\"sourceField\":\"o\"},\"params\":{\"id\":\"string\"}}}]}},\"indexPatternRefs\":[{\"id\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"title\":\"logs-aws.waf*\"}]}},\"visualization\":{\"shape\":\"pie\",\"layers\":[{\"layerId\":\"6a750dcd-fe8a-4ccf-bbd2-77301767e22d\",\"primaryGroups\":[\"o\"],\"metrics\":[\"c\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rules\":[{\"type\":\"other\"}],\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"default\",\"colorMode\":{\"type\":\"categorical\"}}}]},\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS c = COUNT() BY o = event.outcome | SORT c DESC\"},\"filters\":[],\"adHocDataViews\":{\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\":{\"id\":\"a4af72ff223e3a807fb85227c78536a33a606bda7060065498674597bf27ae59\",\"title\":\"logs-aws.waf*\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-aws.waf*\",\"allowHidden\":false,\"managed\":false}}}},\"enhancements\":{}},\"title\":\"Outcome\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":15,\"w\":48,\"h\":10,\"i\":\"0fb61186-1640-4667-acb3-1dde30707490\"},\"panelIndex\":\"0fb61186-1640-4667-acb3-1dde30707490\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Requests over time\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"91cbd3fb-663d-4954-a458-dca192111aa7\":{\"index\":\"91cbd3fb-663d-4954-a458-dca192111aa7\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS c = COUNT() BY b = BUCKET(`@timestamp`, 75, ?_tstart, ?_tend) | SORT b\"},\"columns\":[{\"columnId\":\"b\",\"fieldName\":\"b\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"c\",\"fieldName\":\"c\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"91cbd3fb-663d-4954-a458-dca192111aa7\",\"accessors\":[\"c\"],\"seriesType\":\"line\",\"xAccessor\":\"b\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"c\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Requests over time\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":25,\"w\":24,\"h\":10,\"i\":\"870e5991-a1f1-4e20-bcd8-dac20792a99a\"},\"panelIndex\":\"870e5991-a1f1-4e20-bcd8-dac20792a99a\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Allowed vs blocked\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"62a6258a-7cdf-4e21-9446-09a15c1b93ba\":{\"index\":\"62a6258a-7cdf-4e21-9446-09a15c1b93ba\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS al = SUM(`aws.waf.metrics.AllowedRequests.sum`), bl = SUM(`aws.waf.metrics.BlockedRequests.sum`) BY b = BUCKET(`@timestamp`, 75, ?_tstart, ?_tend) | SORT b\"},\"columns\":[{\"columnId\":\"b\",\"fieldName\":\"b\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"al\",\"fieldName\":\"al\",\"meta\":{\"type\":\"number\"}},{\"columnId\":\"bl\",\"fieldName\":\"bl\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"62a6258a-7cdf-4e21-9446-09a15c1b93ba\",\"accessors\":[\"al\",\"bl\"],\"seriesType\":\"line\",\"xAccessor\":\"b\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"al\",\"axisMode\":\"left\"},{\"forAccessor\":\"bl\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Allowed vs blocked\"},{\"type\":\"lens\",\"gridData\":{\"x\":24,\"y\":25,\"w\":24,\"h\":10,\"i\":\"4139f773-975d-40bd-9af0-d7acb4b07e65\"},\"panelIndex\":\"4139f773-975d-40bd-9af0-d7acb4b07e65\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Counted rules\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"3bb2bfeb-a5b1-453c-a930-2f7e8fab33a6\":{\"index\":\"3bb2bfeb-a5b1-453c-a930-2f7e8fab33a6\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS cnt = SUM(`aws.waf.metrics.CountedRequests.sum`) BY b = BUCKET(`@timestamp`, 75, ?_tstart, ?_tend) | SORT b\"},\"columns\":[{\"columnId\":\"b\",\"fieldName\":\"b\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"cnt\",\"fieldName\":\"cnt\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"line\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"3bb2bfeb-a5b1-453c-a930-2f7e8fab33a6\",\"accessors\":[\"cnt\"],\"seriesType\":\"line\",\"xAccessor\":\"b\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"cnt\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Counted rules\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":35,\"w\":24,\"h\":10,\"i\":\"df55f94a-7abc-48a1-a5e3-6d1176626b47\"},\"panelIndex\":\"df55f94a-7abc-48a1-a5e3-6d1176626b47\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Top client IPs\",\"description\":\"\",\"visualizationType\":\"lnsXY\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"ade5f6f5-404e-4011-b0ec-050477244012\":{\"index\":\"ade5f6f5-404e-4011-b0ec-050477244012\",\"query\":{\"esql\":\"FROM logs-aws.waf* | STATS c = COUNT() BY ip = `source.ip` | SORT c DESC | LIMIT 10\"},\"columns\":[{\"columnId\":\"ip\",\"fieldName\":\"ip\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"c\",\"fieldName\":\"c\",\"meta\":{\"type\":\"number\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"preferredSeriesType\":\"bar_horizontal\",\"legend\":{\"isVisible\":true,\"position\":\"right\"},\"valueLabels\":\"hide\",\"axisTitlesVisibilitySettings\":{\"x\":false,\"yLeft\":false,\"yRight\":false},\"layers\":[{\"layerId\":\"ade5f6f5-404e-4011-b0ec-050477244012\",\"accessors\":[\"c\"],\"seriesType\":\"bar_horizontal\",\"xAccessor\":\"ip\",\"layerType\":\"data\",\"yConfig\":[{\"forAccessor\":\"c\",\"axisMode\":\"left\"}]}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Top client IPs\"},{\"type\":\"lens\",\"gridData\":{\"x\":0,\"y\":45,\"w\":48,\"h\":12,\"i\":\"cf9163d8-465a-4899-99e5-2eeea1e0273c\"},\"panelIndex\":\"cf9163d8-465a-4899-99e5-2eeea1e0273c\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Recent evaluations\",\"description\":\"\",\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"fe139fbc-50a3-4d8b-b3dc-4a9d3874fabe\":{\"index\":\"fe139fbc-50a3-4d8b-b3dc-4a9d3874fabe\",\"query\":{\"esql\":\"FROM logs-aws.waf* | KEEP `@timestamp`, event.action, `aws.waf.terminatingRuleId`, `rule.ruleset`, `source.ip`, `http.request.method`, event.outcome | SORT `@timestamp` DESC | LIMIT 100\"},\"columns\":[{\"columnId\":\"`@timestamp`\",\"fieldName\":\"`@timestamp`\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"event.action\",\"fieldName\":\"event.action\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"aws.waf.terminatingRuleId\",\"fieldName\":\"aws.waf.terminatingRuleId\",\"meta\":{\"type\":\"number\"}},{\"columnId\":\"rule.ruleset\",\"fieldName\":\"rule.ruleset\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"source.ip\",\"fieldName\":\"source.ip\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"http.request.method\",\"fieldName\":\"http.request.method\",\"meta\":{\"type\":\"string\"}},{\"columnId\":\"event.outcome\",\"fieldName\":\"event.outcome\",\"meta\":{\"type\":\"string\"}}],\"timeField\":\"@timestamp\",\"indexPatternRefs\":[]}}}},\"visualization\":{\"layerId\":\"fe139fbc-50a3-4d8b-b3dc-4a9d3874fabe\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"`@timestamp`\",\"isTransposable\":false},{\"columnId\":\"event.action\",\"isTransposable\":false},{\"columnId\":\"aws.waf.terminatingRuleId\",\"isTransposable\":false},{\"columnId\":\"rule.ruleset\",\"isTransposable\":false},{\"columnId\":\"source.ip\",\"isTransposable\":false},{\"columnId\":\"http.request.method\",\"isTransposable\":false},{\"columnId\":\"event.outcome\",\"isTransposable\":false}],\"rowHeight\":\"auto\",\"rowHeightLines\":1},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[]}},\"enhancements\":{}},\"title\":\"Recent evaluations\"}]","optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","timeRestore":true,"timeFrom":"now-24h","timeTo":"now","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"}},"references":[{"type":"tag","id":"74675dbd-10f8-465a-9ade-4db33fe04af6","name":"tag-ref-cloudloadgen"}],"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.3.0"}
